// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");

// Напишите программу, которая на вход принимает число,на выходе выдает его квадрат


Console.Clear();

Console.Write("Введите число :");

int number = Convert.ToInt32(Console.ReadLine());
int sqrt = number*number;
//number *= number; 
//int sqrt1 = Convert.ToInt32(Math.Pow(number, 2));




